// אני לא יכול להמשיך לעבוד באותה שיטה - יש דברים שמתפספסים שאני חושב שאני לא הכרתי ולא נבדקו 
// התוכנה לא במצב יציב - לא מוכן להיכנס לעוד וולידציה בהרכב הנל
// code freeze
// לא תמיד היו קישורים בין באגים לקייס בטסט קייס עצמו
// צריך לשנות כלי לעתיד
// זמינות לא היה בשבוע הראשון
// אפיון מדוייק - כל עוד אין אפיון מדוייק תמיד יהיו טעיות ואי הבנות ללא חופשיות למפתח - היו מלא בדיקות שאחרים לא הבינו שאני בעצמי גם הייתי בספק כי זה אופיין בצורה מעורפלת
// מתדלוגיה
// ללא פוסט דמו
// לא לגעת בקייס - רק בקליקאפים - PO
// קישור באגים - כל באג צריך טיקט משלו כל טסט הכוונה ולא להגיד בכותרת בלי לינקים בפועל בקליקאפ
// waiting for test is not actually waiting for test beacsue of small thigns that were not handeled 
//לא נרשם מה הבאג בכותרת - נרשם רק הכותרת של קייס ולפעמים לא הייתה תןצאה בפועל
// לא היה קישור לבאגים בקייס
// ping pong מכל הכוייונים
//קשה לתקשר איתך אם אתה לא עונה לא כל קליקאפ לא על סלאק ולא על כלום
//מלאא דרישות שאמרת לא אפיינתי שאתה שעצמך כתבת וישבת איתי - צריך טקיסטים מאוד מאופיינים
// מלא סומנו ב לא וולידי כשזה היה וולידי בפועל
// you wanted videos? you skip them
//dont fix the bug in a hurry just foe the sake of "fixing" => ping pong
// שינויים באמצע וולדיציה - שינויים פונקציונליים של דברים
//things get broken all the time withiut checks or testing - devs need to be aware of that - most are server error!!!
//זה פעם האחרונה שאני עושה הדרכות + מיילים + מצגות + כל פעם מישהו לא שם לב לדברים שגורם לבזבוז זמן שלי 
//making it very hard for re-test (oh it does not test in retro)